package api

import (
	"errors"
	"strings"
)

type Code struct {
	Key   string
	Value string
}

func (c *Code) Error() error {
	return errors.New(c.Value)
}

func ResultCode(code string) *Code {
	code = strings.TrimSpace(code)

	if code == "" {
		return nil
	}

	if c, ok := Codes[code]; ok {
		return &Code{Key: code, Value: c}
	}

	return nil
}

var (
	CodeOK = &Code{Key: "0", Value: "接口调用成功"}

	Codes = map[string]string{
		"0":      "接口调用成功",
		"10001":  "内部错误",
		"10003":  "参数不全",
		"10004":  "参数无效",
		"10007":  "用户已被冻结",
		"10008":  "权限不足",
		"10009":  "没有权限访问接口",
		"10010":  "文件校验失败",
		"10011":  "文件过大",
		"10012":  "连接中断",
		"10013":  "操作超时",
		"10014":  "配额设置失败",
		"601006": "平台用户名已经存在， 请修改用户名重新尝试",
		"622132": "查询不到当前用户组管理员在计算中心下的用户组信息",
		"622115": "用户组名额已达上限，请申请增加用户组名额",
		"716020": "查询数据库错误",
		"716864": "执行脚本错误",
		"716865": "创建任务错误",
		"716866": "删除任务失败",
		"716867": "停止任务失败",
		"716868": "启动任务错误",
		"716870": "实例数量错误",
		"815005": "作业提交失败（调度系统没返回）",
		"815007": "作业提交失败（调度系统sbatch失败）",
		"815008": "桌面服务异常",
		"815010": "桌面会话不存在，删除失败",
		"815201": "所有VNC节点均过载或者SSH不通，VNC会话创建失败",
		"911009": "区域用户不存在",
		"911020": "文件不存在",
		"911021": "文件已存在",
		"911022": "目标地址不是一个文件夹",
		"911025": "分享文件已存在，请重命名后分享",
		"911029": "文件路径包含特殊字符，请重命名后再操作",
		"911030": "权限不足，禁止操作",
		"911031": "文件重命名失败",
		"911034": "分享链接创建失败，请重新分享",
		"911404": "ac认证服务端连接异常",
		"911406": "服务端token认证异常，未取到关联用户",
		"911501": "存储空间不足",
		"911502": "目录非空，操作失败",
		"911504": "命令执行超时",
		"911505": "文件大小超出预设大小,无法预览",
		"911506": "文件类型不在预设范围内,不允许打开",
	}
)
